from selenium import webdriver
from selenium.webdriver.chrome.service import Service
from selenium.webdriver.chrome.options import Options
from webdriver_manager.chrome import ChromeDriverManager
from pages.triangle_page import TrianglePage

URL = "https://playground.learnqa.ru/puzzle/triangle"

TEST_CASES = [
    ("3", "4", "6", "Это тупоугольный треугольник", "Позитив"),
    ("3", "4", "6", "Это тупоугольный треугольник", "Позитив"),
    ("5", "5", "8", "Это равнобедренный треугольник", "Позитив"),
    ("5", "5", "5", "Это равносторонний треугольник", "Позитив"),
    ("6", "7", "8", "Это остроугольный треугольник", "Позитив"),
    ("3", "4", "5", "Это прямоугольный треугольник", "Позитив"),
    ("6.5", "6.5", "3.5", "Это равнобедренный треугольник", "Позитив"),
    ("0", "0", "0", "Это не треугольник", "Негатив"),
    ("5", "5", "", "Это НЕ треугольник.", "Негатив"),
    ("3", "4", "' OR 1=1 --", "SQL-инъекции это плохо", "Негатив"),
    ("", "", "", "Задайте все стороны", "Негатив"),
    ("1", "2", "3", "Одна сторона больше суммы двух других или равна ей", "Негатив"),
    ("3", "4", "<script>alert('xss')</script>", "XSS это плохо! Так не получится.", "Негатив"),
    ("a", "2", "3", "Это НЕ треугольник.", "Негатив"),
    ("9999999000", "999999900000", "99999990000", "Числа слишком большие.", "Негатив"),

    # ---Сторона А ---
    ("", "4", "5", "Задайте все стороны", "Негатив"),
    ("0", "4", "5", "Одна сторона больше суммы двух других", "Негатив"),
    ("abc", "4", "5", "Это не треугольник", "Негатив"),
    ("!@#", "4", "5", "Это не треугольник", "Негатив"),
    (" ", "4", "5", "Задайте все стороны", "Негатив"),
    ("null", "4", "5", "Это не треугольник", "Негатив"),
    ("00003", "4", "5", "Это прямоугольный треугольник", "Позитив"),

    # --- Сторона B ---
    ("4", "", "5", "Задайте все стороны", "Негатив"),
    ("4", "0", "5", "Одна сторона больше суммы двух других", "Негатив"),
    ("4", "abc", "5", "Это не треугольник", "Негатив"),
    ("4", "!@#", "5", "Это не треугольник", "Негатив"),
    ("4", " ", "5", "Задайте все стороны", "Негатив"),
    ("4", "null", "5", "Это не треугольник", "Негатив"),
    ("3", "00004", "5", "Это прямоугольный треугольник", "Позитив"),

    # --- Сторона C ---
    ("4", "5", "", "Задайте все стороны", "Негатив"),
    ("4", "5", "0", "Одна сторона больше суммы двух других", "Негатив"),
    ("4", "5", "abc", "Это не треугольник", "Негатив"),
    ("4", "5", "!@#", "Это не треугольник", "Негатив"),
    ("4", "5", " ", "Задайте все стороны", "Негатив"),
    ("4", "5", "null", "Это не треугольник", "Негатив"),
    ("3", "4", "00005", "Это прямоугольный треугольник", "Позитив")
]

options = Options()
options.add_argument("--disable-infobars")
options.add_argument("--start-maximized")
options.add_argument("--disable-extensions")



driver = webdriver.Chrome(service=Service(ChromeDriverManager().install()), options=options)
driver.get(URL)

print("\n🚀 ")

page = TrianglePage(driver)

for a, b, c, expected, test_type in TEST_CASES:
    try:
        page.fill_triangle_sides(a, b, c)
        page.submit()
        result = page.get_result()


        if expected.strip().lower() in result.strip().lower():
            print(f"✅ [{test_type}] {a}, {b}, {c} → '{result}' (ОК)")
        else:
            print(f"❌ [{test_type}] {a}, {b}, {c} → '{result}' (Ожидалось: '{expected}')")
    except Exception as e:
        print(f"❗ [{test_type}] ERROR {a}, {b}, {c}: {e}")

driver.quit()